---
kind: property
id: P:Autodesk.Revit.DB.MEPCurve.Height
zh: 高度
source: html/c8613f87-19b6-69e1-290c-53c0420cf9eb.htm
---
# Autodesk.Revit.DB.MEPCurve.Height Property

**中文**: 高度

The height of the MEP curve.

## Syntax (C#)
```csharp
public double Height { get; }
```

## Remarks
This property is used to retrieve the height of the MEP curve.

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - Thrown when the MEP curve's Shape is not rectangular.